src/50_3_20_openGauss.log
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 50
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            709534
        write:                           200429
        other:                           102489
        total:                           1012452
    transactions:                        50105  (2417.09 per sec.)
    queries:                             1012452 (48841.14 per sec.)
    ignored errors:                      576    (27.79 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          20.7269s
    total number of events:              50105

Latency (ms):
         min:                                    1.58
         avg:                                   20.65
         max:                                 1105.86
         95th percentile:                       21.11
         sum:                              1034714.28

Threads fairness:
    events (avg/stddev):           1002.1000/13.16
    execution time (avg/stddev):   20.6943/0.01

sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 50
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            860090
        write:                           243035
        other:                           124219
        total:                           1227344
    transactions:                        60765  (3035.49 per sec.)
    queries:                             1227344 (61311.46 per sec.)
    ignored errors:                      670    (33.47 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          20.0169s
    total number of events:              60765

Latency (ms):
         min:                                    1.66
         avg:                                   16.46
         max:                                 2030.81
         95th percentile:                       17.63
         sum:                              1000198.48

Threads fairness:
    events (avg/stddev):           1215.3000/14.75
    execution time (avg/stddev):   20.0040/0.00

sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 50
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            608412
        write:                           171772
        other:                           87893
        total:                           868077
    transactions:                        42931  (2132.63 per sec.)
    queries:                             868077 (43122.45 per sec.)
    ignored errors:                      527    (26.18 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          20.1276s
    total number of events:              42931

Latency (ms):
         min:                                    1.74
         avg:                                   23.39
         max:                                 6152.77
         95th percentile:                       15.00
         sum:                              1004220.38

Threads fairness:
    events (avg/stddev):           858.6200/14.21
    execution time (avg/stddev):   20.0844/0.02

sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 50
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            422576
        write:                           119178
        other:                           61082
        total:                           602836
    transactions:                        29773  (1480.71 per sec.)
    queries:                             602836 (29981.07 per sec.)
    ignored errors:                      411    (20.44 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          20.1050s
    total number of events:              29773

Latency (ms):
         min:                                    1.55
         avg:                                   33.71
         max:                                 3090.54
         95th percentile:                       21.11
         sum:                              1003502.13

Threads fairness:
    events (avg/stddev):           595.4600/14.46
    execution time (avg/stddev):   20.0700/0.01

sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 50
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            566538
        write:                           159930
        other:                           81837
        total:                           808305
    transactions:                        39966  (1997.04 per sec.)
    queries:                             808305 (40389.69 per sec.)
    ignored errors:                      501    (25.03 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          20.0118s
    total number of events:              39966

Latency (ms):
         min:                                    1.87
         avg:                                   25.02
         max:                                 2124.43
         95th percentile:                       21.50
         sum:                              1000107.06

Threads fairness:
    events (avg/stddev):           799.3200/18.35
    execution time (avg/stddev):   20.0021/0.00

sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 50
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            632646
        write:                           178576
        other:                           91346
        total:                           902568
    transactions:                        44597  (2166.01 per sec.)
    queries:                             902568 (43836.34 per sec.)
    ignored errors:                      592    (28.75 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          20.5874s
    total number of events:              44597

Latency (ms):
         min:                                    1.75
         avg:                                   23.00
         max:                                 2123.50
         95th percentile:                       20.00
         sum:                              1025836.20

Threads fairness:
    events (avg/stddev):           891.9400/18.13
    execution time (avg/stddev):   20.5167/0.04

sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 50
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            867188
        write:                           245006
        other:                           125252
        total:                           1237446
    transactions:                        61253  (3024.10 per sec.)
    queries:                             1237446 (61093.44 per sec.)
    ignored errors:                      689    (34.02 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          20.2520s
    total number of events:              61253

Latency (ms):
         min:                                    1.73
         avg:                                   16.51
         max:                                 1128.14
         95th percentile:                       18.28
         sum:                              1011538.82

Threads fairness:
    events (avg/stddev):           1225.0600/16.23
    execution time (avg/stddev):   20.2308/0.01

sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 50
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            725046
        write:                           204810
        other:                           104720
        total:                           1034576
    transactions:                        51201  (2367.61 per sec.)
    queries:                             1034576 (47840.38 per sec.)
    ignored errors:                      588    (27.19 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          21.6235s
    total number of events:              51201

Latency (ms):
         min:                                    1.92
         avg:                                   20.33
         max:                                 4075.88
         95th percentile:                       17.95
         sum:                              1040797.82

Threads fairness:
    events (avg/stddev):           1024.0200/16.07
    execution time (avg/stddev):   20.8160/0.40

sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 50
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            867216
        write:                           245090
        other:                           125215
        total:                           1237521
    transactions:                        61275  (3062.03 per sec.)
    queries:                             1237521 (61841.25 per sec.)
    ignored errors:                      669    (33.43 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          20.0105s
    total number of events:              61275

Latency (ms):
         min:                                    1.62
         avg:                                   16.32
         max:                                 3034.66
         95th percentile:                       15.00
         sum:                              1000105.18

Threads fairness:
    events (avg/stddev):           1225.5000/14.10
    execution time (avg/stddev):   20.0021/0.00

sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 50
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            841666
        write:                           237674
        other:                           121594
        total:                           1200934
    transactions:                        59404  (2847.75 per sec.)
    queries:                             1200934 (57571.19 per sec.)
    ignored errors:                      715    (34.28 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          20.8577s
    total number of events:              59404

Latency (ms):
         min:                                    1.99
         avg:                                   17.53
         max:                                 2080.83
         95th percentile:                       16.41
         sum:                              1041179.57

Threads fairness:
    events (avg/stddev):           1188.0800/17.97
    execution time (avg/stddev):   20.8236/0.01